SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( D2203

Comment  ( *****************  Known Required Parameters for OR - Wagon Section ************************)

Comment ( ******************************* General Information *******************************
                         Included in this section - Type, Shape, Size, Mass, etc
          *********************************************************************************** )
Type ( Engine )
WagonShape ( MEP_WisUp.s )
Size ( 2.66731m 3.77475m 7.8m )
Mass ( 30.2t-uk )

	
Comment ( ******************************* Coupler Information *******************************
                    Included in this section - Type, Spring, Buffer, Velocity, etc
          *********************************************************************************** )		
  Coupling (
		Type ( Chain )
		Spring (
        	Stiffness ( 1e6N/m 5e6N/m )
        	Damping ( 1e6N/m/s 1e6N/m/s )
		Break ( 600kN 1000kN )
        	r0 ( 0cm 0cm )
		    )
		comment( CouplingHasRigidConnection () )
		Velocity ( 0.1m/s )
	   )

Comment ( ************************************* Brakes *************************************
              Included in this section - Type, Force, Reservoir, Application, Release, etc
          ********************************************************************************** )
    BrakeEquipmentType ( Vacuum_brake, Auxilary_reservoir, Handbrake )
    BrakeSystemType ( Vacuum_single_pipe )
    MaxBrakeForce ( 82kN )
    MaxHandbrakeForce ( 30kN )
    BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )
    BrakePipeVolume ( 0.65ft^3 )
    ORTSNumberBrakeCylinders ( 2 )
    ORTSBrakeCylinderSize ( 18in )
    MaxReleaseRate ( 10 )Comment (doesn't seem to do anything)
    MaxApplicationRate ( 10 )Comment (doesn't seem to do anything)


Comment ( *************************** Resistance & SuperElevation ***************************
                       Included in this section - Wheelbase, gauge, friction, etc
          *********************************************************************************** )	
	ORTSBearingType ( Friction ) 

Comment(CTN 1990 Resistance Freight Loco)
    ORTSDavis_A ( 466.0 )
    ORTSDavis_B ( 10.1 )
    ORTSDavis_C ( 4.81 )
    ORTSWagonFrontalArea (90ft^2)
    ORTSDavisDragConstant ( 0.0024 )

    CentreOfGravity ( 0ft 8.0ft 0ft )
    ORTSTrackGauge ( 4ft 8.5in )
    ORTSRigidWheelbase ( 9ft 0.0in )
    ORTSUnbalancedSuperelevation ( 6in )



Comment ( ******************************** Lights (If used) ********************************
                  Included in this section - Type, Colour, Location, Size, Control, etc
          ********************************************************************************** )
 Lights ( 33

comment ( ************************AI MAINLINE LIGHTS - WHITE FRONT-RED REAR*************************************)

Light (
   Comment( AI Mainline Front Top White )
   Type ( 0 )
   Conditions (
    Control ( 1 )    
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.005 2.9 3.31 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( AI Mainline Front Left White )
   Type ( 0 )
   Conditions (
    Control ( 1 )    
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.92 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( AI Mainline Front Right White )
   Type ( 0 )
   Conditions (
    Control ( 1 )    
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( 0.87 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( AI Mainline Tail Right Red)
   Type ( 0 )
   Conditions (
    Control ( 1 )    
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.87 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( AI Mainline Tail Left Red)
   Type ( 0 )
   Conditions (
    Control ( 1 )    
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.91 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )

comment ( ************************MAINLINE LIGHTS - WHITE FRONT-RED REAR*****************************************)

Light (
   Comment( Mainline Sphere of light)
   Type ( 1 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffeeeee0 )
     Position ( -0.005 2.9 3.335 )
     Transition ( 0 )
     Radius ( 100 )
     Angle ( 15 )
    )
   )
  )
Light (
   Comment( Mainline Front Top White )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.005 2.9 3.31 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Front Left White )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.92 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Front Right White )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( 0.87 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Front Left Reversed Red )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.92 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Front Right Reversed Red )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.87 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Tail Right Red)
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.87 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Tail Left Red)
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.91 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Tail Right Reversed White)
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( 0.87 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Tail Left Reversed White)
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.91 1.425 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Mainline Tail Top Reversed White )
   Type ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( fffffff0 )
     Position ( -0.005 2.9 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )

comment (*******************YARD LIGHTS YELLOW FRONT - RED REAR - DIM SETTING **********************************)

Light (
   Comment( Yard Sphere of light)
   Type ( 1 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.005 2.9 3.335 )
     Transition ( 0 )
     Radius ( 100 )
     Angle ( 15 )
    )
   )
  )
Light (
   Comment( Yard Front Top Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.005 2.9 3.31 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Middle Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.01 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Left Yellow)
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.92 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Right Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( 0.87 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Top Reverse Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.005 2.9 3.31 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Middle Reverse Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.01 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Left Reverse Red)
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.92 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Front Right Reverse Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 4 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.87 1.425 3.47 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Right Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( 0.87 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Left Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.91 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Top Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.005 2.9 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Middle Red )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff0000 )
     Position ( -0.005 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Right Reverse Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( 0.87 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Left Reverse Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.91 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Top Reverse Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.005 2.9 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
Light (
   Comment( Yard Tail Middle Reverse Yellow )
   Type ( 0 )
   Conditions (
    Headlight ( 2 )
    Unit ( 5 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffff9900 )
     Position ( -0.005 1.43 -3.535 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 0.3 )
    )
   )
  )
 )
 
Comment ( ************************* Wagon Visual Effects (If used) *************************
                          Included in this section - Effect type, etc
          ********************************************************************************** ) 

Comment ( **** Freight and Load Animations*** )  

FreightAnim ( DWSkirts.S 0 3.0 0.0 )


Comment ( **************************** Passenger View (If used) ****************************
                      Included in this section - File, Location, Direction, etc
          ********************************************************************************** )

Comment ( ******** Miscellaneous Information************** ) 
IntakePoint ( 3.33 1.4 FuelDiesel )
Sound ( "..\\..\\common.MEP\\MEP-DrewrySound\\Class01Eng.sms" )
)


Engine ( D2203

 Effects (
  DieselSpecialEffects
  (
   Exhaust1
   (
    0 3.8 2.58
    0 1 0
    0.25
   )
  )
 )

Wagon ( D2203 )
Comment ( *** General Information *** )
WheelRadius ( 21.5in )
Sanding ( 25mph )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 30.2t-uk )

Comment ( *** Diesel Prime Mover (Engine) *** )
Type ( Diesel )
ORTSDieselEngineMaxPower ( 204hp )
MaxDieselLevel( 225g-uk )
MaxTemperature ( 120degF )
MaxOilPressure ( 90 )
DieselUsedPerHourAtMaxPower ( 25g-uk )
DieselUsedPerHourAtIdle ( 6g-uk )
DieselEngineIdleRPM( 100 )
DieselEngineMaxRPM( 800 )
DieselEngineMaxRPMChangeRate( 50 )

Comment ( *** Diesel Engine - Exhaust Effects *** )
DieselSmokeEffectInitialMagnitude(0.6 ) 
DieselSmokeEffectMaxMagnitude( 0.6 ) 
DieselSmokeEffectInitialSmokeRate( 0.25 ) 
DieselSmokeEffectMaxSmokeRate( 3 )   

Comment ( *** Traction Motor *** )
DieselEngineType ( hydraulic )

MaxPower ( 153hp )Comment(204 x 75%)
MaxForce ( 15650lb )
Comment(MaxContinuousForce ( xxxxxlb ))
Comment(ORTSSpeedOfMaxContinuousForce ( 18mph ))
MaxVelocity ( 28mph )

Comment ( ****** Gearing, Gear type, ratio, etc **** )	

GearBoxNumberOfGears( 5 )
GearBoxDirectDriveGear( 5 )
GearBoxMaxSpeedForGears( 6 12 18 24 30 )
GearBoxMaxTractiveForceForGears( 69kN 60kN 48kN 32kN 12kN )
Comment(Max TE = 15650lbf = 69kN) 
Comment(GearBoxOverspeedPercentageForFailure( 170 ))
GearBoxBackLoadForce( 4500 )
GearBoxCoastingForce( 2000 )
GearBoxUpGearProportion( 0.85 )
GearBoxDownGearProportion( 0.35 )
GearBoxOperation( manual )
GearBoxEngineBraking( direct_drive )


Comment (*** Braking system ***)
BrakesEngineBrakeType( Vacuum_single_pipe )
BrakesTrainBrakeType( Vacuum_single_pipe )

Comment (*** Exhausters ***)
Comment (* Electrical exhausters - creating rate 220 cfm // estimate maintaining rate equivalent to 40 cfm @ train pipe *)

Comment(ORTSBrakePipeChargingRate ( 0.55InHg/s )) Comment (* creating rate for RELEASE only *)
Comment (* xxxxxxxxxxORTSBrakePipeChargingRate = 0.11 for RUNNING/SERVICE - maintaining rate *)

Comment (*** Brake Valve Combined ***)
    TrainBrakesControllerMaxSystemPressure ( 21 )
    TrainBrakesControllerMinPressureReduction ( 2inHg )
    EngineBrakesControllerHasProportionalBrake ( 1 )
    Comment(EngineBrakesProportionalBrakeLag ( 0.5 )) Comment (* Loco air brake controlled by train pipe vacuum *)


Comment ( ********************* Locomotive Monitoring Systems (If used) *********************
          Included in this section - Monitoring of Overspeed, Emergency Braking, Vigilance, etc
          *********************************************************************************** )


Comment ( ********************************* Engine Controls *********************************
              Included in this section - Controllers for Regulator, Reverser, Brakes, etc
          *********************************************************************************** ) 
           
EngineControllers (

Comment ( This locomotive fitted with 8 notch controller - Notch 0 = Idle )
      Throttle ( 0 1 0.125 0
          NumNotches ( 9
            Notch ( 0      0 Dummy )
            Notch ( 0.125  0 Dummy )
            Notch ( 0.25   0 Dummy )
            Notch ( 0.375  0 Dummy )
            Notch ( 0.5    0 Dummy )
            Notch ( 0.625  0 Dummy )
            Notch ( 0.75   0 Dummy )
            Notch ( 0.875  0 Dummy )
            Notch ( 1      0 Dummy )
          )
        )
       
            Brake_Train ( 0 1 0.05 0.2
                NumNotches ( 3
                    Notch ( 0.1  0 TrainBrakesControllerReleaseStart )
                    Notch ( 0.2  1 TrainBrakesControllerVacuumContinuousServiceStart )
                    Notch ( 0.9  0 TrainBrakesControllerEmergencyStart )
                    )
                  )
            
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
  		 Gear( 0 5 1 0
                NumNotches ( 6
                 Notch ( 0         0 Dummy )
                 Notch ( 1         0 Dummy )
                 Notch ( 2         0 Dummy )
                 Notch ( 3         0 Dummy )
                 Notch ( 4         0 Dummy )
                 Notch ( 5         0 Dummy )
                        )
                 )

        )

Comment ( ****** Miscellaneous Information Included in this section - Alternate Views, Sounds***** )

DoesHornTriggerBell( 1 )

ORTSExternalSoundPassedThroughPercent ( 50 )          
Sound ( "..\\..\\common.MEP\\MEP-DrewrySound\\Class01Cab.sms" )
CabView ( 03.cvf )
HeadOut ( -1.8 3.0 -1)
Name ( "D2203 Drewry Tram, Semi-Basic Physics, Press B to Start/Stop" )

Comment ( ******************************* Stock Description ********************************
                Included in this section - Stock Description, Operating Procedures, etc
          ********************************************************************************** )
 	Description (
  "The British Rail Drewry Tram - A small Diesel locomotive built"+
 " in 1957-1962, fitted with skirts and cow catchers for the "+
 "Wisbech Tramway. This model is based on the 1960's BR green livery a"+
 "s seen on D2157 at Swindon Works in 1960.\nSPECIFICATIONS :"+
 "\nPower: 204 HP at 1200rpm\nMax. speed: 25.8mph \nPower sou"+
 "rce: 8 Cylinder Gardner 8L3 Engine\nMax. continuous tractiv"+
 "e effort: 15,300 lb (6,885 kg)\nWheel configuration: Six 43"+
 "in. diameter, 0-6-0.\nWeight: 30.685 tons (metric)\nFuel Ca"+
 "pacity: 300gal\nTotal Built: 230\nModel copyright(c) Paul Mitchell"
)
)
